hso-esk/emb6/target/if/cc13xx/cc13xx_cfg.c


//*********************************************************************************
// These settings has been generated for use with TI-RTOS and cc13xxware
//
// Generated by SmartRF Studio version 2.2.1
// Tested with TI-RTOS version tirtos_simplelink_2_14_02
//
//*********************************************************************************


//*********************************************************************************
// Parameter summary
// Address: aa-bb
// Frequency: 868.32500 MHz
// Data Format: Serial mode disable
// Deviation: 25.000 kHz
// Packet Length Config: Variable
// Max Packet Length: 125
// Packet Length: 30
// RX Filter BW: 110 kHz
// Symbol Rate: 50.00000 kBaud
// Sync Word Length: 16 Bits
// TX Power: 14 dBm (requires define CCFG_FORCE_VDDR_HH = 1 in ccfg.c, see CC13xx/CC26xx Technical Reference Manual)
// Whitening: No whitening

#include <cc13xx_cfg.h>
#include <driverlib/rf_mailbox.h>
#include <driverlib/rf_common_cmd.h>
#include <driverlib/rf_prop_cmd.h>
#include "bsp.h"
//#include <ti/drivers/rf/RF.h>


// TI-RTOS RF Mode Object
//RF_Mode RF_802_15_4_prop =
//{
//    .rfMode = RF_MODE_PROPRIETARY,
//    .cpePatchFxn = &rf_patch_cpe_genfsk,
//    .mcePatchFxn = 0,
//    .rfePatchFxn = 0,
//};

// Overrides for CMD_PROP_RADIO_DIV_SETUP
uint32_t pOverrides[] =
{
#if !NETSTK_CFG_IEEE_802154G_EN
    HW32_ARRAY_OVERRIDE(0x2004, 1), // configure new CRC16 poly (=0x40012005 in pure hex)
    0x10210000, // new CRC16 poly: CRC-16-CCITT normal form, 0x1021 is x^16 + x^15 + x^5 + 1
    0xC0040051, // CRC initialization (address)
    0x00000000, // CRC initialization (value)
   //0xC0040061, // override to set the “crcXor” setting (4-byte value)
   //0xFFFFFFFF, // new “crcXor” value to use (default is 0x00000000)
#endif
// override_synth.xml
    ADI_HALFREG_OVERRIDE(0,61,0xF,0xD),
    HW32_ARRAY_OVERRIDE(0x4038,1),
    (uint32_t)0x0000003A,
    HW_REG_OVERRIDE(0x4020,0x7F00),
    HW_REG_OVERRIDE(0x4064,0x0040),
    (uint32_t)0x000684A3,
    (uint32_t)0xC0040141,
    (uint32_t)0x0533B107,
    (uint32_t)0x0A480583,
    (uint32_t)0x7AB80603,
    ADI_REG_OVERRIDE(1,4,0x9F),
    ADI_HALFREG_OVERRIDE(1,7,0x4,0x4),
    (uint32_t)0x02010403,
    (uint32_t)0x00108463,
    (uint32_t)0x04B00243,
    HW_REG_OVERRIDE(0x6084,0x35F1),
    (uint32_t)0x00038883,
    (uint32_t)0x00FB88A3,
// override_phy_agc_reflevel_1A.xml
    HW_REG_OVERRIDE(0x6088,0x001A),
// TX power override
    ADI_REG_OVERRIDE(0,12,0xF8),
    (uint32_t)0xFFFFFFFF,
};


// CMD_PROP_RADIO_DIV_SETUP
rfc_CMD_PROP_RADIO_DIV_SETUP_t RF_802_15_4_cmdPropRadioDivSetup =
{
    .commandNo = 0x3807,
    .status = 0x0000,
    .pNextOp = 0, // INSERT APPLICABLE POINTER: (uint8_t*)&xxx
    .startTime = 0x00000000,
    .startTrigger.triggerType = 0x0,
    .startTrigger.bEnaCmd = 0x0,
    .startTrigger.triggerNo = 0x0,
    .startTrigger.pastTrig = 0x0,
    .condition.rule = 0x1,
    .condition.nSkip = 0x0,
    .modulation.modType = 0x1,
    .modulation.deviation = 0x64,
    .symbolRate.preScale = 0xf,
    .symbolRate.rateWord = 0x8000,
    .rxBw = 0x24,
    .preamConf.nPreamBytes = 0x3,
    .preamConf.preamMode = 0x0,
    .formatConf.nSwBits = 0x10,
    .formatConf.bBitReversal = 0x0,
    .formatConf.bMsbFirst = 0x1,
    .formatConf.fecMode = 0x0,
#if NETSTK_CFG_IEEE_802154G_EN
	.formatConf.whitenMode = 0x6,
#else
	.formatConf.whitenMode = 0x0,
#endif
	.config.frontEndMode = 0x0,
    .config.biasMode = 0x1,
    .config.bNoFsPowerUp = 0x0,
    .txPower = 0xa73f,
    .pRegOverride = pOverrides,
    .centerFreq = 0x0364,
    .intFreq = 0x8000,
    .loDivider = 0x05,
};

// CMD_FS
rfc_CMD_FS_t RF_802_15_4_cmdFs =
{
    .commandNo = 0x0803,
    .status = 0x0000,
    .pNextOp = 0, // INSERT APPLICABLE POINTER: (uint8_t*)&xxx
    .startTime = 0x00000000,
    .startTrigger.triggerType = 0x0,
    .startTrigger.bEnaCmd = 0x0,
    .startTrigger.triggerNo = 0x0,
    .startTrigger.pastTrig = 0x0,
    .condition.rule = 0x1,
    .condition.nSkip = 0x0,
    .frequency = 0x0364,
    .fractFreq = 0x5333,
    .synthConf.bTxMode = 0x0,
    .synthConf.refFreq = 0x0,
    .__dummy0 = 0x00,
    .midPrecal = 0x00,
    .ktPrecal = 0x00,
    .tdcPrecal = 0x0000,
};


// CMD_PROP_TX_ADV
rfc_CMD_PROP_TX_ADV_t RF_802_15_4_cmdPropTxAdv =
{
    .commandNo = 0x3803,
    .status = 0x0000,
    .pNextOp = 0, // INSERT APPLICABLE POINTER: (uint8_t*)&xxx
    .startTime = 0x00000000,
    .startTrigger.triggerType = 0x0,
    .startTrigger.bEnaCmd = 0x0,
    .startTrigger.triggerNo = 0x0,
    .startTrigger.pastTrig = 0x0,
    .condition.rule = 0x1,
    .condition.nSkip = 0x0,
    .pktConf.bFsOff = 0x0,          //!< \brief 0: Keep frequency synth on after command<br>
                                           //!<        1: Turn frequency synth off after command
    .pktConf.bUseCrc = 0x1,      //!< \brief 0: Do not append CRC<br>
                            //!<        1: Append CRC
    .pktConf.bCrcIncSw = 0x0,    //!< \brief 0:Do not include sync word in CRC calculation<br>
                                              //!<        1: Include sync word in CRC calculation
    .pktConf.bCrcIncHdr = 0x0,   //!< \brief 0: Do not include header in CRC calculation<br>
                                 //!<        1: Include header in CRC calculation
#if NETSTK_CFG_IEEE_802154G_EN
    .numHdrBits = 16,          // Number of bits in header (0ï¿½32)

	.preTrigger.triggerType = TRIG_REL_START, /* Setting needed for 15.4g due to bug. Will do the same as TRIG_NOW */
	.preTrigger.bEnaCmd = 0,
	.preTrigger.triggerNo = 0,
	.preTrigger.pastTrig = 1, /* Setting needed for 15.4g due to bug */
	.preTime = 0x0, /* Setting needed for 15.4g due to bug */
#else
    .numHdrBits = 0x8,

    .preTrigger.triggerType = 0x0,
    .preTrigger.bEnaCmd = 0x0,
    .preTrigger.triggerNo = 0x0,
    .preTrigger.pastTrig = 0x0,
    .preTime = 0x00000000,
#endif

    .pktLen = 0x0000,
    .startConf.bExtTxTrig = 0x0,
    .startConf.inputMode = 0x0,
    .startConf.source = 0x0,

    .syncWord = 0x0000904e,
    .pPkt = 0, // INSERT APPLICABLE POINTER: (uint8_t*)&xxx
};



// CMD_PROP_RX_ADV
rfc_CMD_PROP_RX_ADV_t RF_802_15_4_cmdPropRxAdv =
{
    .commandNo = 0x3804,
    .status = 0x0000,
    .pNextOp = 0, // INSERT APPLICABLE POINTER: (uint8_t*)&xxx
    .startTime = 0x00000000,
    .startTrigger.triggerType = 0x0,
    .startTrigger.bEnaCmd = 0x0,
    .startTrigger.triggerNo = 0x0,
    .startTrigger.pastTrig = 0x0,
    .condition.rule = 0x1,
    .condition.nSkip = 0x0,
    .pktConf.bFsOff = 0x0, // 0: Keep frequency synth on after command<br>
    .pktConf.bRepeatOk = 0x1,    // \brief 0: End operation after receiving a packet correctly<br>
                                 //!<        1: Go back to sync search after receiving a packet correctly
    .pktConf.bRepeatNok =  0x1,      //!< \brief 0: End operation after receiving a packet with CRC error<br>
                                     //!<        1: Go back to sync search after receiving a packet with CRC error
    .pktConf.bUseCrc =  0x1,                //!< \brief 0: Do not check CRC<br>
                                            //!<        1: Check CRC
    .pktConf.bCrcIncSw = 0x0,         //  0: Do not include sync word in CRC calculation.
                                    //    1: Include sync word in CRC calculation
    .pktConf.bCrcIncHdr = 0x0,        //  0: Do not include header in CRC calculation.
                                      //  1: Include header in CRC calculation.
    .pktConf.endType = 0x0,
    .pktConf.filterOp = 0x0,

    .rxConf.bAutoFlushIgnored = 0x1,  // If 1, automatically discard ignored packets from RX queue
    .rxConf.bAutoFlushCrcErr = 0x1,   // If 1, automatically discard packets with CRC error from RX queue
    .rxConf.bIncludeHdr = 0x1,        // If 1, include the received header or length byte in the stored packet; otherwise discard it
    .rxConf.bIncludeCrc = 0x1,        // If 1, include the received CRC field in the stored packet; otherwise discard it
    .rxConf.bAppendRssi = 0x1,        // If 1, append an RSSI byte to the packet in the RX queue
    .rxConf.bAppendTimestamp = 0x0,   // If 1, append a timestamp to the packet in the RX queue
    .rxConf.bAppendStatus = 0x0,      // If 1, append a status byte to the packet in the RX queue
    .syncWord0 = 0x0000904e,
    .syncWord1 = 0x00000000,

    .maxPktLen = 2047,  //for the g version     //!< \brief Packet length for fixed length, maximum packet length for variable length<br>
                                                //!<        0: Unlimited or unknown length

#if NETSTK_CFG_IEEE_802154G_EN
	.hdrConf.numHdrBits = 16,          // Number of bits in header (0ï¿½32)
    .hdrConf.numLenBits = 11,
	.lenOffset = -4,
#else
	.hdrConf.numHdrBits = 0x8,
    .hdrConf.numLenBits = 0x8,
    .lenOffset = -2,
#endif
    .hdrConf.lenPos = 0x0,


    .addrConf.addrType = 0x0,
    .addrConf.addrSize = 0x0,
    .addrConf.addrPos = 0x0,
    .addrConf.numAddr = 0x0,
    .endTrigger.triggerType = 0x0,
    .endTrigger.bEnaCmd = 0x0,
    .endTrigger.triggerNo = 0x0,
    .endTrigger.pastTrig = 0x0,
    .endTime = 0x00000000,
    .pAddr = 0, // INSERT APPLICABLE POINTER: (uint8_t*)&xxx
    .pQueue = 0, // INSERT APPLICABLE POINTER: (dataQueue_t*)&xxx
    .pOutput = 0, // INSERT APPLICABLE POINTER: (uint8_t*)&xxx
};
